/*
	µÚÒ»²½£º·ÖÎöÊÂÎï
		Ñ§ÉúÊÂÎï£º
			ÊôÐÔ£ºÑ§ºÅ£¬ÐÕÃû£¬ÄêÁä
			ÐÐÎª£ºÑ§Ï°£¬³Ô·¹£¬Ë¯¾õ

	µÚ¶þ²½£º°ÑÊÂÎï×ª»»ÎªÀà
		Ñ§ÉúÀà£º
			³ÉÔ±±äÁ¿£ºÑ§ºÅ£¬ÐÕÃû£¬ÄêÁä
			³ÉÔ±·½·¨£ºÑ§Ï°£¬³Ô·¹£¬Ë¯¾õ

	µÚÈý²½£º°ÑÀàÓÃÓ¢ÎÄÌåÏÖ
		Student:
			³ÉÔ±±äÁ¿£ºsid£¬name£¬age
			³ÉÔ±·½·¨£ºstudy()£¬eat()£¬sleep()

	µÚËÄ²½£ºÐ´´úÂëÌåÏÖ
		³ÉÔ±±äÁ¿£ºÆäÊµ¾ÍÊÇÒ»¸ö±äÁ¿£¬Ö»²»¹ý¶¨ÒåÔÚÀàÖÐ·½·¨Íâ£¬²¢ÇÒÒ²¿ÉÒÔ²»¸ø³õÊ¼»¯Öµ¡£
		³ÉÔ±·½·¨£ºÆäÊµ¾ÍÊÇÒ»¸ö·½·¨£¬Ö»²»¹ý²»ÐèÒªstaticÁË¡£

	Á·Ï°£º
		ÊÖ»ú
*/
//ÕâÊÇÎÒµÄÑ§ÉúÀà
class Student {
	//³ÉÔ±±äÁ¿
	//Ñ§ºÅ
	String sid;
	//ÐÕÃû
	String name;
	//ÄêÁä
	int age;

	//³ÉÔ±·½·¨
	//Ñ§Ï°µÄ·½·¨
	public void study() {
		System.out.println("Ñ§Éú°®Ñ§Ï°");
	}

	//³Ô·¹µÄ·½·¨
	public void eat() {
		System.out.println("Ñ§ÉúÒª³Ô·¹");
	}

	//Ë¯¾õµÄ·½·¨
	public void sleep() {
		System.out.println("Ñ§ÉúÏëË¯¾õ");
	}
}